  /*****************************************************************************
  * @file   errors.c
  *
  * @brief   Подсистема обработки ошибок
  *
  * @author  Проект-Техника, Малышев Сергей <onega.malishev@yandex.ru>
  *
  * @version v1.0
  *
  * @date	 05/10/19
  *
  ******************************************************************************
  * @attention
  *
  * ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО
  * ГАРАНТИЙ, ЯВНО ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ ГАРАНТИИ ТОВАРНОЙ
  * ПРИГОДНОСТИ, СООТВЕТСТВИЯ ПО ЕГО КОНКРЕТНОМУ НАЗНАЧЕНИЮ И ОТСУТСТВИЯ
  * НАРУШЕНИЙ, НО НЕ ОГРАНИЧИВАЯСЬ ИМИ. ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ
  * ПРЕДНАЗНАЧЕНО ДЛЯ ОЗНАКОМИТЕЛЬНЫХ ЦЕЛЕЙ И НАПРАВЛЕНО ТОЛЬКО НА
  * ПРЕДОСТАВЛЕНИЕ ДОПОЛНИТЕЛЬНОЙ ИНФОРМАЦИИ О ПРОДУКТЕ, С ЦЕЛЬЮ СОХРАНИТЬ ВРЕМЯ
  * ПОТРЕБИТЕЛЮ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ
  * ОТВЕТСТВЕННОСТИ ПО КАКИМ-ЛИБО ИСКАМ, ЗА ПРЯМОЙ ИЛИ КОСВЕННЫЙ УЩЕРБ, ИЛИ
  * ПО ИНЫМ ТРЕБОВАНИЯМ, ВОЗНИКШИМ ИЗ-ЗА ИСПОЛЬЗОВАНИЯ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ
  * ИЛИ ИНЫХ ДЕЙСТВИЙ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
  *
  *							 2019 АО "ПРОЕКТ-ТЕХНИКА"
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "errors.h"

/* Varibles ------------------------------------------------------------------*/
void * pxTaskErrors = NULL;			/*! Указатель на подсистему обработки ошибок */
uint32_t ErrorCounter = 0;	  	  	/*! Счетчик активных ошибок класса ERROR */
uint32_t NotAckErrorCounter = 0;	/*! Счетчик неподтвержденных ошибок класса ERROR */
uint32_t FatalCounter = 0;		    /*! Счетчик активных ошибок класса FATAL */
uint32_t NotAckFatalCounter = 0;	/*! Счетчик неподтвержденных ошибок класса FATAL */
uint32_t WarningCounter = 0;	  	/*! Счетчик активных ошибок класса WARNING */
uint32_t NotAckWarningCounter = 0;  /*! Счетчик неподтвержденных ошибок класса WARNING */

/* Function ------------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Инициализация подсистемы обработки ошибок					 */
/*---------------------------------------------------------------*/
void vTaskErrorsInit (void)
{

}
/*---------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Task Errors 													 */
/*---------------------------------------------------------------*/
void vTaskErrors(void *pvParameters)
{
	/* Инициализация Task Errors */
	vTaskErrorsInit();

	/* Запуск Task Errors  */
	for (;;)
	{
		int a = 5;
		a++;
    }
}
/*---------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Реакция NONE (нет действия)									 */
/*---------------------------------------------------------------*/
void ErrorActionNone(void){
	return;
}
/*---------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Реакция GB_OPEN (отключение контактора генератора)			 */
/*---------------------------------------------------------------*/
void ErrorActionGBOpen(void){

	return;
}
/*---------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Реакция MB_OPEN (отключение контактора сети)					 */
/*---------------------------------------------------------------*/
void ErrorActionMBOpen(void){

	return;
}
/*---------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Реакция STOP	(охлаждение и остановка ДВС)					 */
/*---------------------------------------------------------------*/
void ErrorActionStop(void){

	return;
}
/*---------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Реакция SHUTDOWN (остановка ДВС и отключение конткторов)		 */
/*---------------------------------------------------------------*/
void ErrorActionShutdown(void){

	return;
}
/*---------------------------------------------------------------*/

/*---------------------------------------------------------------*/
/* Реакция AUTORESET (выход из режима АВТОМАТ)					 */
/*---------------------------------------------------------------*/
void ErrorActionAutoReset(void){

	return;
}
/*---------------------------------------------------------------*/

const Error_Descriptor_t ErrorEmergencyStop [] = {
{ 0, FATAL, ALL,"Аварийный стоп",'!', NULL, NULL, ErrorActionShutdown },
{ 1, WARNING, ALL,"Неудачный пуск",'!', NULL, NULL, ErrorActionAutoReset },
{ 2, WARNING, ALL,"Ген не готов",'!', NULL, NULL, ErrorActionAutoReset },
{ 3, WARNING, ALL,"Ген не готов",'!', NULL, NULL, ErrorActionAutoReset }



};


